Documents/ЗакрытиеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеЛицевогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеЛьготы</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.ЛицевыеСчета</xr:Item>
				<xr:Item>InformationRegister.ДополнительныеРеквизитыЛицевогоСчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.МашиноМеста</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрописанныхЖильцах</xr:Item>
				<xr:Item>InformationRegister.СведенияОПроживающихЖильцах</xr:Item>
				<xr:Item>InformationRegister.НазначенныеСубсидии</xr:Item>
				<xr:Item>InformationRegister.ОтветственныйВладелецЛицевогоСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеЛицевогоСчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

// Функция возвращает данные о лицевом счете.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры
